In [7]:
import pandas as pd

filepath_s5 = r"https://github.com/data-to-insight/ERN-sessions/raw/main/data/903_xlsx_errors.xlsx"

df_s5 = pd.read_excel(filepath_s5, sheet_name=None)
#df_s5.keys()
df_s5["header"].head(10)

    CHILD  SEX         DOB ETHNIC            UPN  MOTHER MC_DOB
0  566910    2  27/03/2008   WROM  D051910639385     NaN    NaN
1  384923    2  09/09/2011   REFU  L034811502612     NaN    NaN
2  709901    1  14/02/2013   ABAN  Y021751958510     NaN    NaN
3  550084    2  04/05/2008   AOTH  R095578985099     NaN    NaN
4  710229    2  15/04/2002   REFU  Z095096287583     NaN    NaN
5  733831    1  06/07/2013   WROM  Z005227500041     NaN    NaN
6   69112    2  11/09/2010   ABAN  X089575916879     NaN    NaN
7  853884    2  09/10/2004   WBRI  U096513817313     NaN    NaN
8  634852    2  19/10/2006   WIRI  X019131453866     NaN    NaN
9  512087    1  01/10/2003   MOTH  J091207487052     NaN    NaN

In [9]:
#102 error is dob is not valid date
#d/m/y
# to_datetime() - format argument - "%d/%m/%y"
# errors ="coerce" - NA where not correctly formatted
header_s5 = df_s5["header"]

header_s5['DOB_dt']= pd.to_datetime(header_s5["DOB"],format="%d/%m/%Y", errors="coerce")
invalid_dobs = header_s5["DOB_dt"].isna()
error_rows =header_s5[invalid_dobs]
error_rows

            CHILD  SEX    DOB ETHNIC    UPN  MOTHER MC_DOB DOB_dt
2675  bad_entry_1    7  oops!  Alien  UPDOG     NaN    NaN    NaT

In [13]:
p4a = df_s5["placed_for_adoption"]
p4a ["placed_DT"] = pd.to_datetime (p4a["DATE_PLACED"],format="%d/%m/%Y", errors="coerce")
invalid_place = p4a["placed_DT"].isna()
error_placed= p4a[invalid_place]
error_placed

,CHILD,DOB,DATE_PLACED,DATE_PLACED_CEASED,REASON_PLACED_CEASED,placed_DT
29,bad_entry_1,Not a date,This isn't a valid date,This also isn't a date,oop,NaT

In [15]:
ethnicity_codes = [
        "WBRI",
        "WIRI",
        "WOTH",
        "WIRT",
        "WROM",
        "MWBC",
        "MWBA",
        "MWAS",
        "MOTH",
        "AIND",
        "APKN",
        "ABAN",
        "AOTH",
        "BCRB",
        "BAFR",
        "BOTH",
        "CHNE",
        "OOTH",
        "REFU",
        "NOBT",
    ]
error_ethnic = header_s5[~header_s5["ETHNIC"].isin(ethnicity_codes)]
error_ethnic

            CHILD  SEX    DOB ETHNIC    UPN  MOTHER MC_DOB DOB_dt
2675  bad_entry_1    7  oops!  Alien  UPDOG     NaN    NaN    NaT

In [22]:
ad1 = df_s5["ad1"]

error_rows = ad1[~ad1["FOSTER_CARE"].isin([0,1])]
error_rows

,CHILD,DOB,DATE_INT,DATE_MATCH,FOSTER_CARE,NB_ADOPTR,SEX_ADOPTR,LS_ADOPTR
29,bad_entry,datedate,notdate,datenot,777,Q,Will,let's go

In [ ]:
merged_df = p4a.merge(header_s5[["CHILD","DOB_dt"]],on="CHILD",how="left")
#merged_df

,CHILD,DOB,DATE_PLACED,DATE_PLACED_CEASED,REASON_PLACED_CEASED,placed_DT,DOB_dt
0,988635,15/06/2013,22/11/2015,07/04/2017,XXX,2015-11-22,2013-06-15
1,161125,24/07/2002,08/05/2015,24/02/2018,XXX,2015-05-08,2002-07-24
2,590545,24/11/2008,12/09/2015,23/04/2017,XXX,2015-09-12,2008-11-24
3,757606,12/12/2003,16/09/2015,23/02/2018,XXX,2015-09-16,2003-12-12
4,921450,11/10/2006,02/03/2015,15/08/2017,XXX,2015-03-02,2006-10-11
5,4022,11/05/2001,11/11/2015,30/12/2017,XXX,2015-11-11,2001-05-11
6,127650,24/02/2013,05/09/2015,22/06/2017,XXX,2015-09-05,2013-02-24
7,624227,04/07/2008,27/01/2015,24/09/2017,XXX,2015-01-27,2008-07-04
8,711458,06/05/2009,19/03/2015,27/11/2017,XXX,2015-03-19,2009-05-06
9,549562,25/07/2009,30/10/2015,22/11/2017,XXX,2015-10-30,2009-07-25
10,83008,05/06/2005,06/02/2015,16/10/2017,XXX,2015-02-06,2005-06-05
11,764585,01/06/2011,17/05/2015,08/12/2017,XXX,2015-05-17,2011-06-01
12,432916,28/01/2002,02/08/2015,08/03/2018,XXX,2015-08-02,2002-01-28
13,232351,08/11/2006,09/10/2015,02/08/2017,XXX,2015-10-09,2006-11-08
14,682447,10/07/2008,02/01/2015,03/11/2017,XXX,2015-01-02,2008-07-10
15,979106,11/04/2013,04/02/2015,12/01/2018,XXX,2015-02-04,2013-04-11
16,177224,16/04/2008,17/01/2015,02/11/2017,XXX,2015-01-17,2008-04-16
17,150309,12/12/2003,22/04/2015,10/04/2017,XXX,2015-04-22,2003-12-12
18,912765,25/04/2007,24/06/2015,02/05/2017,XXX,2015-06-24,2007-04-25
19,258758,09/01/2012,10/06/2015,22/04/2017,XXX,2015-06-10,2012-01-09
20,183392,03/09/2012,28/03/2015,02/03/2018,XXX,2015-03-28,2012-09-03
21,882662,24/07/2003,26/09/2015,22/11/2017,XXX,2015-09-26,2003-07-24
22,867782,20/09/2002,02/09/2015,04/04/2017,XXX,2015-09-02,2002-09-20
23,398366,07/06/2010,17/03/2015,29/05/2017,XXX,2015-03-17,2010-06-07
24,465676,09/05/2012,30/05/2015,29/05/2017,XXX,2015-05-30,2012-05-09
25,553789,15/07/2010,06/12/2015,08/02/2018,XXX,2015-12-06,2010-07-15
26,667633,26/10/2007,01/06/2015,02/05/2017,XXX,2015-06-01,2007-10-26
27,940956,02/04/2011,30/01/2015,29/11/2017,XXX,2015-01-30,2011-04-02
28,458257,21/02/2007,23/08/2015,03/01/2018,XXX,2015-08-23,2007-02-21
29,bad_entry_1,Not a date,This isn't a valid date,This also isn't a date,oop,NaT,NaT

In [43]:
born_error = df_s5["episodes"]
born_error
born_error["DECOM_dt"] = pd.to_datetime(born_error["DECOM"], dayfirst=True)
combined_born = born_error.merge(header_s5[["CHILD","DOB_dt"]],on="CHILD",how="left")
combined_born
error_rows = combined_born[combined_born["DOB_dt"]> combined_born["DECOM_dt"]]

error_rows

Empty DataFrame
Columns: [CHILD, DECOM, RNE, LS, CIN, PLACE, PLACE_PROVIDER, DEC, REC, REASON_PLACE_CHANGE, HOME_POST, PL_POST, URN, DECOM_dt, DOB_dt]
Index: []

In [44]:
combined_ordered = combined_born.sort_values(["CHILD","DECOM_dt"], ascending=True)
combi_first = combined_ordered.drop_duplicates("CHILD", keep="first")
combi_first

,CHILD,DECOM,RNE,LS,CIN,PLACE,PLACE_PROVIDER,DEC,REC,REASON_PLACE_CHANGE,HOME_POST,PL_POST,URN,DECOM_dt,DOB_dt
4801,32,12/02/2017,T,J1,N3,K2,PR1,15/04/2017,E3,NaN,ED8 1OX,WI5 9CC,7876040,2017-02-12,2008-02-15
4041,982,27/11/2016,P,E1,N7,A5,PR3,07/10/2017,X1,LAREQ,EP10 1XZ,WI5 8XU,6162294,2016-11-27,2010-11-21
437,1243,02/01/2017,L,V4,N5,Z1,PR0,18/05/2017,E9,NaN,EC5 5MZ,WC30 9OS,7270736,2017-01-02,2002-08-19
1794,1407,28/11/2015,L,L2,N3,P2,PR1,29/04/2017,X1,ALLEG,EG16 2ZL,WU19 1JS,6492318,2015-11-28,2003-06-26
3848,2431,20/02/2016,S,V2,N3,P2,PR5,18/11/2017,X1,APPRR,EK12 3JI,WV1 1FJ,5227516,2016-02-20,2001-01-19
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
498,997201,18/05/2016,P,L3,N4,T3,PR3,07/06/2017,X1,CUSTOD,EL12 3BA,WV22 6GC,3780837,2016-05-18,2006-05-24
2766,997445,20/06/2016,P,J1,N2,U3,PR3,24/09/2017,E48,NaN,EP2 2VO,WE6 1FZ,3786993,2016-06-20,2009-06-20
154,998192,27/11/2015,P,C2,N2,P1,PR5,08/07/2017,X1,ALLEG,EJ11 4FS,WT21 5RE,6722585,2015-11-27,2007-07-25
156,998777,11/10/2015,P,C2,N2,U1,PR2,17/03/2018,X1,CLOSE,ER24 5VS,WJ7 5PQ,1112628,2015-10-11,2007-11-16
323,999397,17/02/2017,L,L1,N7,P2,PR1,29/08/2017,X1,NaN,EC5 2KK,WV19 3SY,3534004,2017-02-17,2001-07-01